# -*- coding: utf-8 -*-
cl_data = {
    "академическая": {"чай": 0, "кофе": 1},
    "царицыно": {"чай": 2, "кофе": 0},
    "окружная": {"чай":0, "кофе": 1},
    "тимирязевская": {"чай": 0, "кофе": 1},
    "молодежная": {"чай": 0, "кофе": 1},
    "текстильщики": {"чай": 1, "кофе": 0},
    "войковская": {"чай": 2, "кофе": 2},
    "бабушкинская": {"чай": 1,"кофе": 0},
    "отрадное": {"чай": 1, "кофе": 0},
    #"коптево": {"чай": 1, "кофе": 0},
    "орехово": {"чай": 1, "кофе": 0},
    "ховрино": {"чай":1, "кофе": 0},
    "бутырская": {"чай":0, "кофе": 1},
    "комсомольская": {"чай": 0, "кофе": 1},
    "речной вокзал": {"чай":0, "кофе": 1},
    "сокол": {"чай":0, "кофе": 1},
}